work/WinVent/Kastenfenster/V03/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/initialisationConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $!internalField/T;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform $!atmosphere/T;
        inlet	    	uniform $!atmosphere/T;
    }

    /*staticWalls
    {
        type            fixedValue;
	value uniform $!surface/T;
    }*/

    window
    {
        type zeroGradient;
    }

    glassWalls
    {
        type            compressible::thermalBaffle1D<eConstSolidThermoPhysics>;
        
        // Für jeden Patch individuell:
        //neighbourPatch  $patchName_slave;  // Dynamisch
        
        thickness       uniform 0.006;
        qs              uniform 0;
        qr              none;
        qrRelaxation    1;
        
        specie
        {
            molWeight       60.08;
        }
        transport
        {
            kappa           0.0342;
        }
        thermodynamics
        {
            hf              0;
            Cv              840;
        }
        equationOfState
        {
            rho             2500;
        }
        
        //value           uniform $!surface/T;
    }
    
    // Spezifische Patches:
    glass_inside_master
    {
        $glassWalls;
        neighbourPatch  glass_inside_slave;
        value           uniform $!surface/T;  // Innentemperatur
    }
    
    glass_inside_slave
    {
        $glassWalls;
        neighbourPatch  glass_inside_master;
        value           uniform 283.15;
    }
    
    glass_outside_master
    {
        $glassWalls;
        neighbourPatch  glass_outside_slave;
        value           uniform 283.15;
    }
    
    glass_outside_slave
    {
        $glassWalls;
        neighbourPatch  glass_outside_master;
        value           uniform $!atmosphere/T;
    }

    walls
    {
        type            fixedValue;
	    value uniform $!surface/T;
    }

    //staticWalls
    /*walls
    {
	type codedFixedValue;
        value uniform $!surface/T;
	name thermoWall;

        codeOptions
        #{
            -I"../../include"
        #};
        codeInclude
        #{
            #include "thermoWallCode.H"
        #};

        code
        #{
            
            scalar rho = 2000.0;    // kg/m3 (concrete)
            scalar cp = 1000.0;     // J/(kg K) thermal capacity
            scalar d = 0.2;         // m (thickness of wall)
            updateThermoWall(*this, rho, cp, d);
        #};
    }*/



    movingWalls
    {
        type zeroGradient;
    }

    nonCouple
    {
        type            zeroGradient;
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
