work/WinVent/Kastenfenster/V03/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    atmosphere
    {
        type            pressureInletOutletVelocity;
        inletValue      $internalField;
        value           $internalField;
    }

    /*innerInlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }*/

    staticWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    glassWalls
    {
        type            noSlip;
    }
    
    movingWalls
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    nonCouple
    {
	type		movingWallSlipVelocity;
        value           uniform (0 0 0);
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
