work/WinVent/Kastenfenster/V03/0.orig/Y_CO2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Y_CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/initialisationConditions"


dimensions      [0 0 0 0 0 0 0];

internalField  uniform $!internalField/Y_CO2;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    atmosphere
    {
        type  inletOutlet;
        inletValue uniform $!atmosphere/Y_CO2;
        value uniform $!atmosphere/Y_CO2;
    }

    staticWalls
    {
        type            zeroGradient;
    }

    glassWalls
    {
        $staticWalls;
    }

    movingWalls
    {
        $staticWalls;
    }

    nonCouple
    {
        type            zeroGradient;
    }

    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
