work/WinVent/Kastenfenster/V03/system/fvSchemes
 /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;
    div(phi,U)                      Gauss limitedLinearV 0.5;
    div(phi,e)                      Gauss limitedLinear01 0.5;
    div(phi,h)                      Gauss limitedLinear01 0.5;
    div(phi,K)                      Gauss limitedLinear01 0.5;
    div(phi,(p|rho))                Gauss limitedLinear01 0.5;
    div(phi,k)                      Gauss limitedLinear01 0.5;
    div(phi,epsilon)               Gauss limitedLinear01 0.5;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss limitedLinear01 0.5;
    div(phi,CO2) Gauss limitedLinear01 0.5;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
